# StartSlot Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..StartSlot Property
ElectricalSystem Class See Also
---
The Start Slot where the Electrical System is located in its panel.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int StartSlot { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartSlot As Integer
	Get
```

Visual C++
---
```text
public:
property int StartSlot {
	int get ();
}
```

# Remarks
This property is used to retrieve the Start Slot of the Electrical System.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace